// Класс списка карточек новостей

export default class NewsCardList {
  constructor(cardList){
    this.cardList = cardList;
  }

  // принимает массив экземпляров карточек и отрисовывает их
  renderResults() {

  }

  // отвечает за отрисовку лоудера
  renderLoader() {

  }

  // принимает объект ошибки и показывает ошибку в интерфейсе
  renderError() {

  }

  // отвечает за функциональность кнопки «Показать ещё»
  showMore() {

  }

  // принимает экземпляр карточки и добавляет её в список
  addCard() {

  }
}